(() => {
  let all = [{
      '排序方法': '冒泡排序',
      '时间复杂度(平均)': 'O(n^2)',
      '时间复杂度(最坏)': 'O(n^2)',
      '时间复杂度(最好)': 'O(n^2)',
      '空间复杂度': 'O(1)',
      '稳定性': '稳定',
    }, {
      '排序方法': '选择排序',
      '时间复杂度(平均)': 'O(n^2)',
      '时间复杂度(最坏)': 'O(n^2)',
      '时间复杂度(最好)': 'O(n^2)',
      '空间复杂度': 'O(1)',
      '稳定性': '不稳定',
    }, {
      '排序方法': '插入排序',
      '时间复杂度(平均)': 'O(n^2)',
      '时间复杂度(最坏)': 'O(n^2)',
      '时间复杂度(最好)': 'O(n)',
      '空间复杂度': 'O(1)',
      '稳定性': '稳定',
    },
    {
      '排序方法': '希尔排序',
      '时间复杂度(平均)': 'O(n^1.3)',
      '时间复杂度(最坏)': 'O(n^2)',
      '时间复杂度(最好)': 'O(n)',
      '空间复杂度': 'O(1)',
      '稳定性': '不稳定',
    }, {
      '排序方法': '快速排序',
      '时间复杂度(平均)': 'O(nlog2(n))',
      '时间复杂度(最坏)': 'O(n^2)',
      '时间复杂度(最好)': 'O(nlog2(n))',
      '空间复杂度': 'O(log2(n))',
      '稳定性': '不稳定',
    }, {
      '排序方法': '归并排序',
      '时间复杂度(平均)': 'O(nlog2(n))',
      '时间复杂度(最坏)': 'O(nlog2(n))',
      '时间复杂度(最好)': 'O(nlog2(n))',
      '空间复杂度': 'O(n)',
      '稳定性': '稳定',
    }, {
      '排序方法': '堆排序',
      '时间复杂度(平均)': 'O(nlog2(n))',
      '时间复杂度(最坏)': 'O(nlog2(n))',
      '时间复杂度(最好)': 'O(nlog2(n))',
      '空间复杂度': 'O(1)',
      '稳定性': '不稳定',
    },
    {}, {
      '排序方法': '计数排序',
      '时间复杂度(平均)': 'O(n+k)',
      '时间复杂度(最坏)': 'O(n+k)',
      '时间复杂度(最好)': 'O(n+k)',
      '空间复杂度': 'O(n+k)',
      '稳定性': '稳定',
    }, {
      '排序方法': '桶排序',
      '时间复杂度(平均)': 'O(n+k)',
      '时间复杂度(最坏)': 'O(n^2)',
      '时间复杂度(最好)': 'O(n)',
      '空间复杂度': 'O(n+k)',
      '稳定性': '稳定',
    }, {
      '排序方法': '基数排序',
      '时间复杂度(平均)': 'O(n*k)',
      '时间复杂度(最坏)': 'O(n*k)',
      '时间复杂度(最好)': 'O(n*k)',
      '空间复杂度': 'O(n+k)',
      '稳定性': '稳定',
    }
  ]

  console.table(all);
})();